snlkuharlocal/src/Catalogs/ТаблицаНастроекЗаполненияСписков/ТаблицаНастроекЗаполненияСписков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТаблицаНастроекЗаполненияСписков</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипНастройки</name>
    <type>
      <types>CatalogRef.ТипыНастроекЗаполненияСписков</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойРеквизит</name>
    <type>
      <types>Characteristic.ЗначенияНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНастройки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеНастройки</name>
    <type>
      <types>Characteristic.ЗначенияНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрокаНеограниченная</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиСоответствия</name>
    <attributes>
      <name>ЗначениеНастройки</name>
      <type>
        <types>Characteristic.ЗначенияНастроек</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеНастройки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ТаблицаНастроекЗаполненияСписков/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)      
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипНастройки = 0 Тогда
		ЗначениеСтрокаНеограниченная = "";
		СтрокиСоответствия.Очистить();
	ИначеЕсли ТипНастройки = 1 Тогда
		ЗначениеНастройки = Неопределено;          
		ЗначениеСтрокаНеограниченная = "";
	ИначеЕсли ТипНастройки = 2 Тогда
		ЗначениеНастройки = Неопределено;	
		СтрокиСоответствия.Очистить();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти
